/*:
 ## Упражнение — конкатенация и интерполяция
 
 Создайте константу `city` и присвойте ей строковое значение, представляющее населённый пункт, где вы родились.  Затем создайте константу `state` и присвойте ей строковое значение, соответствующее области (или стране) вашего рождения.  Теперь создайте константу `home` и используйте конкатенацию строк, чтобы получить новую строку с населённым пунктом и областью или страной (например, «Калмань, Владимирская область»).  Выведите значение `home`.
 */
let city = "Bugulma"
let state = "Tatarstan, Russia"
let home = city + ", " + state
print(home)
/*:
 Используйте составной оператор присваивания (`+=`), чтобы добавить `home` к `introduction` ниже.  Выведите значение `introduction`.
 */
var introduction = "Моё место рождения: "
introduction += home
print(introduction)
/*:
 Объявите константу `name` и присвойте ей значение вашего имени в виде строки.  Затем объявите константу `age` и присвойте ей значение вашего текущего возраста целого типа `Int`.  Затем выведите следующую фразу с использованием строковой интерполяции:
 
 — "Меня зовут <ИМЯ> и после моего следующего дня рождения мне будет <ВОЗРАСТ>."
 
 Вставьте в нужном месте `name` и математическое выражение, вычисляющее значение вашего текущего возраста, увеличенное на единицу.
 */
let name = "Daniel"
let ageOne = 29
let ageTwo = ageOne + 1

print("Меня зовут \(name) и после моего следующего дня рождения мне будет \(ageTwo).")
//: [Ранее](@previous)  |  страница 2 из 5  |  [Далее: Упражнение для приложения — извещения](@next)
